Revit 2027 API
AssetProperty.GetConnectedProperty Method
 Gets one connected property with specified index.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AssetProperty GetConnectedProperty(
	int index
)
Public Function GetConnectedProperty (
	index As Integer
) As AssetProperty
public:
AssetProperty^ GetConnectedProperty(
	int index
)
member GetConnectedProperty :
        index : int -> AssetProperty
Parameters
index Int32
Return Value
AssetProperty
 The AProperty of that index.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  index is out of range.
See Also
Reference
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace